app/views/api/playlists/show.json.jbuilder

SELECT "playlist_songs".* FROM "playlist_songs" WHERE "playlist_songs"."playlist_id" = $1  [["playlist_id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."song_name" = $1 LIMIT $2  [["song_name", "Nikes"], ["LIMIT", 1]]
---
json.playlist_songs do
    @playlist.playlist_songs.each do |song|
        s = Song.find_by(song_name: song.song_name)