app/controllers/api/playlists_controller.rb

INSERT INTO "playlists" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["user_id", 10], ["created_at", "2020-03-28 19:09:38.588362"], ["updated_at", "2020-03-28 19:09:38.588362"]]
---
    def create
        @playlist = Playlist.new(playlist_params)
        @playlist.user_id = current_user.id

        if @playlist.save

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @playlist = Playlist.find(params[:id])