app/controllers/api/songs_controller.rb

    def index
        # @songs = AWS::S3::Bucket.find(bumpify-dev).objects
        @songs = Song.all
---
SELECT "songs".* FROM "songs"