app/views/api/artists/index.json.jbuilder

        json.partial! "api/artists/artist", artist: @artist
        json.albumIds artist.albums.pluck(:id)
---
SELECT "albums"."id" FROM "albums" WHERE "albums"."artist_id" = $1  [["artist_id", 9]]