app/views/api/artists/show.json.jbuilder

SELECT  "songs".* FROM "songs" INNER JOIN "albums" ON "songs"."album_id" = "albums"."id" WHERE "albums"."artist_id" = $1 ORDER BY RANDOM() LIMIT $2  [["artist_id", 6], ["LIMIT", 5]]
---
popular_songs = @artist.songs.order('RANDOM()').limit(5).to_a

SELECT "albums"."id" FROM "albums" WHERE "albums"."artist_id" = $1  [["artist_id", 6]]
---
    json.partial! "api/artists/artist", artist: @artist
    json.album_ids @artist.albums.pluck(:id)

SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = $1  [["artist_id", 6]]
---
# albums
@artist.albums.each do |album|