app/views/api/albums/show.json.jbuilder

json.partial! "api/albums/album", album: @album
json.song_ids @album.songs.pluck(:id)
---
SELECT "songs"."id" FROM "songs" WHERE "songs"."album_id" = $1  [["album_id", 9]]